# CreateRibbonPanel Method (String, String) (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
UIApplication..::..CreateRibbonPanel Method (String, String)
UIApplication Class See Also
---
Create a new RibbonPanel on the specified tab.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual RibbonPanel CreateRibbonPanel(
	string tabName,
	string panelName
)
```

Visual Basic
---
```text
Public Overridable Function CreateRibbonPanel ( _
	tabName As String, _
	panelName As String _
) As RibbonPanel
```

Visual C++
---
```text
public:
virtual RibbonPanel^ CreateRibbonPanel(
	String^ tabName,
	String^ panelName
)
```

# ### Parameters
tabName
    Type: System..::..StringThe name of the tab, on which the new panel will be created.
panelName
    Type: System..::..StringThe name of the panel to be created.
# Remarks
This method will create a custom panel appending to the specified tab. This method is not supported in Macros.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | tabName or panelName is nullNothingnullptra null reference (Nothing in Visual Basic). |
| Autodesk.Revit.Exceptions..::..ArgumentException | tabName or panelName is Empty. |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | Too many panels have been added to this tab (Maximum is 100). |

# See Also
UIApplication Class
CreateRibbonPanel Overload
Autodesk.Revit.UI Namespace